Repository: c24-fewo/sequel-ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: ru

source: Check the Console for possible errors inside the primary key(s) of this table!
ru: Проверьте консоль на наличие возможных ошибок основного ключа(ей) этой таблицы!

source: Please check the Console and inform the Sequel Ace team!
ru: Пожалуйста, передайте необходимую информацию из консоли команде Sequel Ace!

source: Reload the table to be sure that the contents have not changed in the meantime.
ru: Перезагрузите таблицу, чтобы убедиться, что содержимое не изменилось за это время.

source: You should also add a primary key to this table!
ru: Вы также должны добавить первичный ключ к этой таблице!

source: %@ %@ selected
ru: Выбрано %1$@ %2$@

source: %@ (Filtered by %@)
ru: %1$@ (отфильтровано по %2$@)

source: %@ (Page %lu)
ru: %1$@ (страница %2$lu)

source: %@ Copy
ru: %@ — копия

source: %@ row in partial load
ru: %@ строка с частичной нагрузкой

source: %@ row in table
ru: %@ строка в таблице

source: %@ row of %@%@ matches filter
ru: %1$@ из %2$@%3$@ отфильтрованных строк

source: %@ rows in partial load
ru: %@ строк с частичной загрузкой

source: %@ rows in table
ru: %@ строк в таблице

source: %@ rows of %@%@ match filter
ru: %1$@ из %2$@%3$@ отфильтрованных строк

source: %@; %ld rows affected
ru: %1$@; %2$ld строк затронуто

source: %@; %ld rows affected in total, by %ld queries taking %@
ru: %1$@; при выполнении %2$ld запросов(а) была затронуто строк: %3$ld, что заняло %4$@

source: %@; 1 row affected
ru: %@; 1 строка изменена

source: %@; 1 row affected in total, by %ld queries taking %@
ru: %1$@; при выполнении %2$ld запросов(а) была затронута 1 строка, что заняло %3$@

source: %@; Cancelled after %@
ru: %1$@; Отменено после %2$@

source: %@; Cancelled in query %ld, after %@
ru: %1$@; Отменено на запросе %2$ld, после %3$@

source: %@ MySQL said: %@
ru: %1$@ MySQL сообщил: %2$@

source: %lu favorite
ru: %lu избранное

source: %lu favorites
ru: %lu избранные

source: %lu group
ru: %lu группа

source: %lu groups
ru: %lu группы

source: %ld additional rows were removed!
ru: Дополнительно удалено строк: %ld!

source: %ld of %lu record(s)
ru: %1$ld из %2$lu записей(и)

source: %ld of first %lu record(s)
ru: %1$ld из первых %2$lu записей(и)

source: %ld rows were not removed.
ru: %ld строк(и) не удалено.

source: %lu files already exist. Do you want to replace them?
ru: %lu файлы(ов) уже существуют. Вы хотите заменить их?

source: %lu files could not be created
ru: %lu файла(ов) не могут быть созданы

source: %lu files with the same names already exist in the target folder. Replacing them will overwrite their current contents.
ru: %lu файлов с теми же именами уже существует в целевой папке. Их замена перезапишет текущее содержимое.

source: %lu of %lu
ru: %1$lu из %2$lu

source: %lu of the export files could not be created because their target export folder is not writable; please select a new export location and try again.
ru: Не получается создать %lu файлов экспорта, потому что их целевая папка недоступна для записи; пожалуйста, выберите новое место для экспорта и повторите попытку.

source: %lu of the export files could not be created because their target export folder no longer exists; please select a new export location and try again.
ru: Не получается создать %lu файлов экспорта, потому что их целевая папка больше не существует; пожалуйста, выберите новое место для экспорта и повторите попытку.

source: (no selection)
ru: (ничего не выбрано)

source: (not loaded)
ru: (не загружено)

source: (This usually indicates that the connection has been closed by the server after inactivity, but can also occur due to other conditions. The connection has been restored; please try again if the query is safe to re-run.)
ru: (Обычно это указывает на то, что соединение было закрыто сервером из-за неактивности, но может быть и по другим причинам. Соединение было восстановлено; пожалуйста, повторите попытку, если запрос безопасен для перезапуска.)

source: , first row available after %1$@
ru: , первые данные начали поступать через %1$@

source: , taking %1$@
ru: , затрачено %1$@

source: [ERROR in query %ld] %@
ru: [ОШИБКА в запросе %1$ld] %2$@

source: [ERROR in row %ld] %@
ru: [ОШИБКА в строке %1$ld] %2$@

source: [multiple selection]
ru: [множественный выбор]

source: [name required]
ru: [требуется имя]

source: [no selection]
ru: [ничего не выбрано]

source: (In addition, one or more errors occurred while attempting to create the export files: %lu could not be created. These files will be ignored.)
ru: (Кроме того, при создании экспортируемых файлов произошла одна или несколько ошибок: %lu не может быть создан. Эти файлы будут проигнорированы.)

source: Press ⇧ for binary search (case-sensitive).
ru: Нажмите ⇧ для бинарного поиска (с учётом регистра).

source: A bit-field type. M specifies the number of bits. If shorter values are inserted, they will be aligned on the least significant bit. See the SET type if you want to explicitly name each bit.
ru: Битовый тип поля. M задает количество битов. Если добавляются более короткие значения, то они будут выровнены по наименее значиму биту. Смотрите тип SET, если вы хотите явно называть каждый бит.

source: A Bundle ‘%@’ is already installed. Do you want to update it?
ru: Пакет ‘%@’ уже установлен. Вы хотите обновить его?

source: A byte array with fixed length. Shorter values will always be padded to the right with 0x00 until they fit M.
ru: Байт-массив с фиксированной длиной. Более короткие значения всегда заполняются справа значением 0x00 до достижениями ими длины M.

source: A byte array with variable length. The actual number of bytes is further limited by the values of other fields in the row.
ru: Массив байтов с переменной длиной. Фактическое количество байт ограничено значениями последующих полей в строке таблицы.

source: A byte array with variable length. Unlike VARBINARY this type does not count towards the maximum row length.
ru: Массив байтов с переменной длиной. В отличие от VARBINARY этот тип не учитывается при подсчёте максимальной длины строки таблицы.

source: A character string that can store up to 255 bytes, but requires less space for shorter values. The actual number of characters is further limited by the used encoding. Unlike VARCHAR this type does not count towards the maximum row length.
ru: Символьная строка, которая может хранить до 255 байт, но занимает меньше места для более коротких значений. Фактическое количество символов ограничено используемой кодировкой. В отличие от VARCHAR этот тип не засчитывается при подсчёте максимальной длины строки таблицы.

source: A character string that can store up to M bytes, but requires less space for shorter values. The actual number of characters is further limited by the used encoding and the values of other fields in the row.
ru: Символьная строка, которая может хранить до M байт, но занимает меньше места для более коротких значений. Фактическое количество символов также ограничено используемой кодировкой и значениями других полей в строке таблицы.

source: A data type that validates JSON data on INSERT and internally stores it in a binary format that is both, more compact and faster to access than textual JSON. Available from MySQL 5.7.8.
ru: Тип данных, который проверяет JSON данные при INSERT-е и хранит их в двоичном формате, что одновременно компактнее и способно обеспечить более быстрый доступ по сравнению с текстовым JSON-ном. Доступно в MySQL 5.7.8.

source: A file with the same name already exists in the target folder. Replacing it will overwrite its current contents.
ru: Файл с таким именем уже существует в целевой папке. Замена файла перезапишет его содержимое.

source: A foreign key needs this index
ru: Внешний ключ нуждается в этом индексе

source: A SET can define up to 64 members (as strings) of which a field can use one or more using a comma-separated list. Upon insertion the order of members is automatically normalized and duplicate members will be eliminated. Assignment of numbers is supported using the same semantics as for BIT types.
ru: Тип SET может содержать до 64 значений (строк), которые могут задаваться как одно или несколько значений поля, разделённые запятыми. Задания значений, их порядок автоматически нормализуется, а дубликаты удаляются. Присвоение значений чисел поддерживается при использовании той же семантики, что и для типов BIT.

source: A SSH key location was specified, but no file was found in the specified location. Please re-select the key and try again.
ru: Расположение ключа SSH было указано, но файл не был найден в указанном месте. Пожалуйста, выберите ключ повторно и повторите попытку.

source: A SSL Certificate Authority certificate location was specified, but no file was found in the specified location. Please re-select the Certificate Authority certificate and try again.
ru: Местоположение SSL сертификата Центра сертификации было указано, но в указанном месте файл не найден. Пожалуйста, выберите сертификат и повторите попытку.

source: A SSL certificate location was specified, but no file was found in the specified location. Please re-select the certificate and try again.
ru: Местоположение сертификата SSL было указано, но в указанном месте файла не найдено. Пожалуйста, выберите сертификат и повторите попытку.

source: A SSL key file location was specified, but no file was found in the specified location. Please re-select the key file and try again.
ru: Местоположение ключа для сертификата SSL было указано, но в указанном месте файла не найдено. Пожалуйста, выберите сертификат и повторите попытку.

source: A user with the host '%@' already exists
ru: Пользователь на узле '%@' уже существует

source: A user with the name '%@' already exists
ru: Пользователь с именем '%@' уже существует

source: Access denied!
ru: Доступ запрещён!

source: Accurate to approx. 15 decimal places
ru: С точностью примерно 15 знаков после запятой

source: Accurate to approx. 7 decimal places
ru: С точностью примерно 7 знаков после запятой

source: Active connection window is busy. Please wait and try again.
ru: Текущее окно подключения занято. Пожалуйста, подождите и повторите попытку.

source: ACTIVITIES
ru: ДЕЙСТВИЯ

source: Add
ru: Добавить

source: Add Database...
ru: Создать базу данных...

source: Add Host
ru: Добавить узел

source: Add Value or Expression…
ru: Добавить значение или выражение…

source: Adding index...
ru: Добавление индекса...

source: Advanced
ru: Расширенные

source: Alerts & Logs
ru: Оповещения и журналы

source: Alerts & Logs Preferences
ru: Настройки оповещений и журналов

source: All Databases
ru: Все базы данных

source: All Databases (%)
ru: Все базы данных (%)

source: All the export files already exist. Do you want to replace them?
ru: Все экспортируемые файлы уже существуют. Вы хотите заменить их?

source: An error has occurred and there doesn't seem to be a connection available.
ru: Произошла ошибка и похоже, что соединение недоступно.

source: An error occur while executing a scheme command. If the scheme command was invoked by a Bundle command, it could be that the command still runs. You can try to terminate it by pressing ⌘+. or via the Activities pane.
ru: При выполнении команды к БД произошла ошибка. Если команда к БД была вызвана командой пакета, то возможно она всё ещё выполняется. Вы можете попробовать её прервать, нажав ⌘+. или сделать это через панель Действий.

source: An error occurred while attempting to kill connection %lld. MySQL said: %@
ru: При попытке принудительного разрыва соединения %1$lld произошла ошибка. MySQL сообщил: %2$@

source: An error occurred while attempting to kill the query associated with connection %lld. MySQL said: %@
ru: При попытке принудительно завершить запрос, связанный с соединением %1$lld произошла ошибка. MySQL сообщил: %2$@

source: An error occurred while creating table syntax. : %@
ru: Произошла ошибка при формировании запроса создания таблицы. : %@

source: An error occurred while renaming '%@'. No temporary name could be found. Please try renaming to something else first.
ru: Произошла ошибка при переименовании '%@'. Временное название не найдено. Пожалуйста, попробуйте сперва использовать другое название.

source: An error occurred while renaming '%@'. MySQL said: %@
ru: При переименовании '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred while renaming. '%@' is of an unknown type.
ru: Произошла ошибка при переименовании: '%@' имеет неизвестный тип.

source: An error occurred while renaming. I couldn't delete '%@'. MySQL said: %@
ru: При переименовании произошла ошибка: не получается удалить '%1$@'. MySQL сообщил: %2$@

source: An error occurred while renaming. I couldn't recreate '%@'. MySQL said: %@
ru: При переименовании произошла ошибка: не получается пересоздать '%1$@'. MySQL сообщил: %2$@

source: An error occurred while renaming. I couldn't retrieve the syntax for '%@'. MySQL said: %@
ru: При переименовании произошла ошибка: не получается получить запрос создания '%1$@'. MySQL сообщил: %2$@

source: An error occurred while renaming. The CREATE syntax of '%@' could not be parsed.
ru: При переименовании произошла ошибка: не удалось разобрать CREATE запрос для '%@'.

source: An error occurred while retrieving status data. MySQL said: %@
ru: При получении данных о состоянии произошла ошибка. MySQL сообщил: %@

source: An error occurred while retrieving the create syntax for '%@'. MySQL said: %@
ru: При получении запроса создания '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred while trying to add the index. MySQL said: %@
ru: При попытке добавить индекс произошла ошибка. MySQL сообщил: %@

source: An error occurred while trying to add the password to your Keychain. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Ace team, supplying the error code %i.
ru: Произошла ошибка при попытке добавить пароль в Связку ключей. Попробуйте восстановить Связку ключей, а если это не поможет, то сообщите команде Sequel Ace код ошибки %i.

source: An error occurred while trying to copy the database '%@' to '%@'.
ru: Произошла ошибка при попытке скопировать базу данных '%1$@' в '%2$@'.

source: An error occurred while trying to delete the index. MySQL said: %@
ru: При попытке удалить индекс произошла ошибка. MySQL сообщил: %@

source: An error occurred while trying to determine the number of rows for %@. MySQL said: %@ (%lu)
ru: При попытке определить количество строк для “%1$@” произошла ошибка. MySQL сообщил: %2$@ (%3$lu)

source: An error occurred while trying to rename the database '%@' to '%@'.
ru: Произошла ошибка при попытке переименовать базу данных '%1$@' в '%2$@'.

source: An error occurred while trying to retrieve the Keychain item you're trying to edit. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Ace team, supplying the error code %i.
ru: Произошла ошибка при попытке загрузить пароль из Связки ключей для вашей правки. Попробуйте восстановить Связку ключей, а если это не поможет, то сообщите команде Sequel Ace код ошибки %i.

source: An error occurred while trying to update the Keychain item. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Ace team, supplying the error code %i.
ru: Произошла ошибка при попытке обновить пароль в Связке ключей. Попробуйте восстановить Связку ключей, а если это не поможет, то сообщите команде Sequel Ace код ошибки %i.

source: An error occurred
ru: Произошла ошибка

source: An error occurred retrieving table information. MySQL said: %@
ru: При получении информации о таблице произошла ошибка. MySQL сообщил: %@

source: An error occurred when reading the file, as it could not be read in the encoding you selected (%@). Only %ld queries were executed.
ru: An error occurred when reading the file, as it could not be read in the encoding you selected (%1$@). Only %2$ld queries were executed.

source: An error occurred when reading the file, as it could not be read using the encoding you selected (%@). Only %ld rows were imported.
ru: An error occurred when reading the file, as it could not be read using the encoding you selected (%1$@). Only %2$ld rows were imported.

source: An error occurred when reading the file. Only %ld queries were executed. (%@)
ru: An error occurred when reading the file. Only %1$ld queries were executed. (%2$@)

source: An error occurred when reading the file. Only %ld rows were imported. (%@)
ru: Произошла ошибка при чтении файла. Было импортировано строк: %1$ld. (%2$@)

source: An error occurred when trying to add the field '%@' via %@ MySQL said: %@
ru: При попытке добавить поле '%1$@' через %2$@ произошла ошибка. MySQL сообщил: %3$@

source: An error occurred when trying to change the field '%@' via %@ MySQL said: %@
ru: При попытке изменить поле '%1$@' через %2$@ произошла ошибка. MySQL сообщил: %3$@

source: An error occurred when trying to change the table collation to '%@'. MySQL said: %@
ru: При попытке изменить сортировку таблицы на '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred when trying to change the table encoding to '%@'. MySQL said: %@
ru: При попытке изменить кодировку таблицы на '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred when trying to change the table type to '%@'. MySQL said: %@
ru: При попытке изменить тип таблицы на '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred when trying to change the table's comment to '%@'. MySQL said: %@
ru: При попытке изменить комментарий таблицы на '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred while analyzing the %@. MySQL said:%@
ru: При анализе %1$@ произошла ошибка. MySQL сообщил:%2$@

source: An error occurred while fetching the optimized field type. MySQL said:%@
ru: При получении оптимизированного типа поля произошла ошибка. MySQL сообщил:%@

source: An error occurred while flushing the %@. MySQL said:%@
ru: При очистке %1$@ произошла ошибка. MySQL сообщил:%2$@

source: An error occurred while importing SQL
ru: При импорте SQL произошла ошибка

source: An error occurred while optimzing the %@. MySQL said:%@
ru: При оптимизации %1$@ произошла ошибка. MySQL сообщил:%2$@

source: An error occurred while performing the checksum on %@. MySQL said:%@
ru: При вычислении контрольной суммы %1$@ произошла ошибка. MySQL сообщил:%2$@

source: An error occurred while repairing the %@. MySQL said:%@
ru: Произошла ошибка при исправлении %1$@. MySQL сообщил:%2$@

source: An error occurred while retrieving information. MySQL said: %@
ru: При получении информации произошла ошибка. MySQL сообщил: %@

source: An error occurred while retrieving the information for table '%@'. Please try again. MySQL said: %@
ru: При получении информации по таблице '%1$@' произошла ошибка. Пожалуйста, попробуйте ещё раз. MySQL сообщил: %2$@

source: An error occurred while retrieving the trigger information for table '%@'. Please try again. MySQL said: %@
ru: При получении информации триггера для таблицы '%1$@' произошла ошибка. Пожалуйста, попробуйте ещё раз. MySQL сообщил: %2$@

source: An error occurred while trying to add the new column '%@' by %@. MySQL said: %@
ru: При попытке добавить новый столбец '%1$@' произошла ошибка. %2$@. MySQL сообщил: %3$@

source: An error occurred while trying to add the new table '%@' by %@. MySQL said: %@
ru: An error occurred while trying to add the new table '%1$@' by %2$@. MySQL said: %3$@

source: An error occurred while trying to add the new table '%@'. MySQL said: %@
ru: Произошла ошибка при попытке добавить новую таблицу '%1$@'. MySQL сообщил: %2$@

source: An error occurred while trying to alter table '%@'. MySQL said: %@
ru: Произошла ошибка при попытке изменить таблицу '%1$@'. MySQL сообщил: %2$@

source: An error occurred while trying to check the %@. MySQL said:%@
ru: Произошла ошибка при попытке проверить %1$@. MySQL сообщил:%2$@

source: An error occurred while trying to delete the relation '%@'. MySQL said: %@
ru: Произошла ошибка при попытке удалить связь '%1$@'. MySQL сообщил: %2$@

source: An error occurred while trying to get the list of users. Please make sure you have the necessary privileges to perform user management, including access to the mysql.user table.
ru: Произошла ошибка при попытке получить список пользователей. Пожалуйста, убедитесь, что у вас есть необходимые права управления пользователями, включая доступ к таблице mysql.user.

source: An error occurred while trying to import a table via: %@ MySQL said: %@
ru: При импорте таблицы произошла ошибка: %1$@ MySQL сообщил: %2$@

source: An error occurred while trying to move the field. MySQL said: %@
ru: При попытке передвинуть поле произошла ошибка. MySQL сообщил: %@

source: An error occurred while trying to reset AUTO_INCREMENT of table '%@'. MySQL said: %@
ru: Произошла ошибка при попытке сбросить AUTO_INCREMENT таблицы '%1$@'. MySQL сообщил: %2$@

source: An error occurred while trying to truncate the table '%@'. MySQL said: %@
ru: При попытке очистить таблицу '%1$@' произошла ошибка. MySQL сообщил: %2$@

source: An error occurred whilst trying to perform the operation. MySQL said: %@
ru: При попытке выполнить операцию произошла ошибка. MySQL сообщил: %@

source: Resource Limits are not supported for your version of MySQL. Any Resouce Limits you specified have been discarded and not saved. MySQL said: %@
ru: Ограничения ресурсов не поддерживаются для вашей версии MySQL. Любые ограничения ресурсов, которые вы указали, были отклонены и не сохранились. MySQL сообщил: %@

source: Analyze %@
ru: Анализ %@

source: Analyze Selected Items
ru: Проанализировать выбранные элементы

source: Analyze Table
ru: Проанализировать таблицу

source: Analyze table failed.
ru: Не получилось проанализировать таблицу.

source: Are you sure you want to clear the global history list? This action cannot be undone.
ru: Вы уверены, что хотите очистить всю историю запросов? Это действие необратимо.

source: Are you sure you want to clear the history list for %@? This action cannot be undone.
ru: Вы уверены, что хотите очистить историю запросов для %@? Это действие необратимо.

source: Are you sure you want to delete ALL records in the selected tables? This operation cannot be undone.
ru: Вы уверены, что хотите удалить ВСЕ записи в выбранных таблицах? Это действие необратимо.

source: Are you sure you want to delete ALL records in the table '%@'? This operation cannot be undone.
ru: Вы уверены, что хотите удалить ВСЕ записи таблицы '%@'? Это действие необратимо.

source: Are you sure you want to delete all the rows from this table? This action cannot be undone.
ru: Вы уверены, что хотите удалить все строки этой таблицы? Это действие небратимо.

source: Are you sure you want to delete the %@ '%@'? This operation cannot be undone.
ru: Вы уверены, что хотите удалить %1$@ '%2$@'? Это действие необратимо.

source: Are you sure you want to delete the database '%@'? This operation cannot be undone.
ru: Вы уверены, что хотите удалить базу данных'%@'? Это действие необратимо.

source: Are you sure you want to delete the favorite '%@'? This operation cannot be undone.
ru: Вы уверены, что хотите удалить из избранного"%@'? Это действие необратимо.

source: Are you sure you want to delete the field '%@'? This action cannot be undone.
ru: Вы уверены, что хотите удалить поле "%@'? Это действие необратимо.

source: Are you sure you want to delete the group '%@'? All groups and favorites within this group will also be deleted. This operation cannot be undone.
ru: Вы уверены, что хотите удалить группу '%@'? Все подгруппы и избранное в этой группе также будут удалены. Это действие необратимо.

source: Are you sure you want to delete the index '%@'? This action cannot be undone.
ru: Вы уверены, что хотите удалить индекс "%@'? Это действие необратимо.
