Repository: c24-fewo/sequel-ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: ru

source: include BLOB
ru: включая BLOB

source: Include content
ru: Включая содержимое

source: Incompatible encoding in SQL file
ru: Несовместимая кодировка в SQL файле

source: INFORMATION
ru: ИНФОРМАЦИЯ

source: Inherit from database (%@)
ru: Наследовать из базы данных (%@)

source: Initializing...
ru: Инициализация...

source: Input Field
ru: Поле ввода

source: Input Field is not editable.
ru: Поле ввода не редактируемо.

source: Input Field Scope commands will run on each text input field
ru: Область поля ввода команды будут нацелены на каждое поле ввода текста

source: Insert as Snippet
ru: Вставить как сниппет

source: Insert as Text
ru: Вставить как текст

source: Installed Bundles
ru: Установленные пакеты

source: Installing Bundle
ru: Установка пакета

source: Insufficient connection details
ru: Недостаточно данных для подключения

source: Interpret data as:
ru: Данные интерпретированы как:

source: Invalid database
ru: Повреждённая база данных

source: Invalid file supplied!
ru: Недопустимый файл!

source: Invalid hexadecimal value
ru: Неверное шестнадцатеричное значение

source: Is Deterministic
ru: Детерминированный

source: Is Nullable
ru: NULL разрешён

source: is updatable: %@
ru: обновляемо: %@

source: items
ru: элементы

source: JavaScript Exception
ru: Ошибка JavaScript

source: JavaScript Parsing Error
ru: Ошибка разбора JavaScript

source: Key
ru: Ключ

source: Keyword
ru: Ключевое слово

source: Kill
ru: Завершить принудительно

source: Kill connection?
ru: Разорвать соединение?

source: Kill query?
ru: Принудительно завершить запрос?

source: Last Error Message
ru: Сообщение об ошибке

source: Last Used
ru: Выполнялся

source: Limited to @@max_allowed_packet
ru: Ограничено до @@max_allowed_packet

source: Loading %@...
ru: Загрузка %@...

source: Loading database '%@'...
ru: Загрузка базы данных '%@'...

source: Loading history entry...
ru: Загрузка записи истории...

source: Loading page %lu...
ru: Загрузка страницы %lu...

source: Loading reference...
ru: Загрузка связи...

source: Loading table data...
ru: Загрузка данных таблицы...

source: Low memory
ru: Экономия памяти

source: M (precision): Up to 65 digits D (scale): 0 to 30 digits
ru: M (точность): до 65 цифр D (шкала): от 0 до 30 цифр

source: M: %@ to %@ bytes
ru: М: от %1$@ до %2$@ байт

source: M: %@ to %@ characters
ru: М: от %1$@ до %2$@ символов

source: M: %@ to %@ characters (4 GiB)
ru: М: от %1$@ до %2$@ символов (4 ГиБ)

source: M: 0 to 255 bytes
ru: М: от 0 до 255 байт

source: M: 0 to 255 characters
ru: М: от 0 до 255 символов

source: M: 1 (default) to 64
ru: М: от 1 (по умолчанию) до 64

source: Make sure the file contains a X.509 client certificate and is using PEM encoding.
ru: Убедитесь, что файл содержит сертификат клиента X.509 и использует PEM кодировку.

source: Maximum number of arguments is 2!
ru: Максимальное количество аргументов: 2!

source: Maximum text length is set to %ld.
ru: Длина текста ограничена %ld.

source: Maximum text length is set to %ld. Inserted text was truncated.
ru: Длина текста ограничена %ld. Вставленный текст был усечён.

source: Maximum text length is set to %llu.
ru: Длина текста ограничена %llu.

source: Maximum text length is set to %llu. Inserted text was truncated.
ru: Длина текста ограничена %llu. Вставленный текст был усечён.

source: Message
ru: Сообщение

source: MGTemplateEngine Error
ru: Ошибка MGTemplateEngine

source: Month
ru: Месяц

source: multiple selection
ru: множественный выбор

source: MySQL connecting...
ru: Подключение к MySQL...

source: MySQL Error
ru: Ошибка MySQL

source: MySQL Help
ru: Справка по MySQL

source: MySQL Help for Selection
ru: MySQL справка по выделенному

source: MySQL Help for Word
ru: MySQL справка по слову

source: MySQL Help – Categories
ru: MySQL справка – Категории

source: MySQL said:
ru: MySQL сообщил:

source: MySQL said: %@
ru: MySQL сообщил: %@

source: MySQL said: %@
ru: MySQL сообщил: %@

source: MyTheme
ru: МояTема

source: Network
ru: Сеть

source: Network Preferences
ru: Настройки сети

source: Files
ru: Файлы

source: File Preferences
ru: Настройки файлов

source: New Bundle
ru: Новый пакет

source: New Column Name
ru: Имя нового столбца

source: New Favorite
ru: Новое избранное

source: New Filter
ru: Новый фильтр

source: New Folder
ru: Новая папка

source: New Name
ru: Новое имя

source: New Table
ru: Новая таблица

source: No color theme data found.
ru: Данные цветовой темы не найдены.

source: no compression
ru: без сжатия

source: No connection available
ru: Нет доступного подключения

source: No connection data found.
ru: Данные для подключения не найдены.

source: No content filters found.
ru: Фильтры контента не найдены.

source: No data found.
ru: Данные не найдены.

source: No errors
ru: Без ошибок

source: No Favorties
ru: Нет избранных

source: No files could be created
ru: Файлы не могут быть созданы

source: No item found
ru: Элементы не найдены

source: No local port could be allocated for the SSH Tunnel.
ru: Ни один локальный порт не может быть выделен для SSH туннеля.

source: NO MATCHES
ru: НЕТ СОВПАДЕНИЙ

source: No optimized field type found.
ru: Не найден оптимизированный тип поля.

source: No query favorites found.
ru: Не найдено избранных запросов.

source: No results found.
ru: Ничего не найдено.

source: None
ru: Нет

source: Not available
ru: Недоступно

source: Number of arguments: %lu
ru: Количество аргументов: %lu

source: Numeric
ru: Числа

source: OK
ru: ОК

source: One additional row was removed!
ru: Удалена одна дополнительная строка!

source: One row was not removed.
ru: Одна строка не удалилась.

source: Only one dragged item allowed.
ru: Допускается только один перетаскиваемый элемент.

source: Only Partially Supported
ru: Только частичная поддержка

source: Open Function in New Tab
ru: Открыть функцию в новой вкладке

source: Open Function in New Window
ru: Открыть функцию в новом окне

source: Open in New Tab
ru: Открыть в новой вкладке

source: Open in New Window
ru: Открыть в новом окне

source: Open Procedure in New Tab
ru: Открыть процедуру в новой вкладке

source: Open Procedure in New Window
ru: Открыть процедуру в новом окне

source: Open Table in New Tab
ru: Открыть таблицу в новой вкладке

source: Open Table in New Window
ru: Открыть таблицу в новом окне

source: Open View in New Tab
ru: Открыть представление в новой вкладке

source: Open View in New Window
ru: Открыть представление в новом окне

source: Open %@ in New Window
ru: Открыть %@ в новом окне

source: Optimize %@
ru: Оптимизировать %@

source: Optimize Selected Items
ru: Оптимизировать выбранные элементы

source: Optimize Table
ru: Оптимизировать таблицу

source: Optimize table failed.
ru: Не удалось оптимизировать таблицу.

source: Optimized type for field '%@'
ru: Оптимизированный тип поля '%@'

source: optional
ru: необязательно

source: Permission Denied
ru: Доступ запрещён

source: Please choose a favorite
ru: Пожалуйста, выберите избранное

source: Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel.
ru: Пожалуйста, введите имя хоста для SSH туннеля или отключите SSH туннель.

source: Please enter the password for ‘%@’:
ru: Пожалуйста, введите пароль для «%@»:

source: Print
ru: Напечатать

source: Print Page…
ru: Напечатать страницу…

source: Privileges
ru: Права

source: procedure
ru: процедура

source: PROCEDURE INFORMATION
ru: О ПРОЦЕДУРЕ

source: procedures
ru: процедуры

source: Proceed
ru: Продолжить

source: PROCS & FUNCS
ru: ПРОЦЕДУРЫ И ФУНКЦИИ

source: Query
ru: Запрос

source: Query Background
ru: Фон запроса

source: Query cancelled.
ru: Запрос отменён.

source: Query Editor
ru: Редактор запросов

source: Query Editor Preferences
ru: Настройки редактора запроса

source: Query logging is currently disabled
ru: Журнал запросов в настоящее время отключён

source: Query Result
ru: Результат запроса

source: Query results
ru: Результаты запроса

source: Query Status
ru: Статус запроса

source: Querying row count failed
ru: Не удалось запросить количество строк

source: Quick Connect
ru: Быстрое подключение

source: Quote
ru: Кавычки

source: Renaming the database '%@' is currently unsupported as it contains objects other than tables (i.e. views, procedures, functions, etc.). If you would like to rename a database please use the 'Duplicate Database', move any non-table objects manually then drop the old database.
ru: Переименование базы данных '%@' в настоящее время не поддерживается, поскольку она содержит объекты, отличные от таблиц (например, представления, процедуры, функции и т.д.). Если вы хотите переименовать базу данных, пожалуйста, используйте функцию 'Дублировать базу данных', затем переместите нетабличные объекты вручную, а потом удалите старую базу данных.

source: Range: %@ to %@
ru: Диапазон: от %1$@ до %2$@

source: Range: -838:59:59.0 to 838:59:59.0 F (precision): 0 (1s) to 6 (1µs)
ru: Диапазон: от -838:59:59.0 до 838:59:59:59.0 F (точность): 0 (1s) до 6 (1μs)

source: Range: 0000, 1901 to 2155
ru: Диапазон: 0000, 1901–2155

source: Range: 1 to 64 members 1, 2, 3, 4 or 8 bytes storage
ru: Диапазон: от 1 до 64 участников 1, 2, 3, 4 или 8 байт хранения

source: Range: 1000-01-01 00:00:00.0 to 9999-12-31 23:59:59.999999 F (precision): 0 (1s) to 6 (1µs)
ru: Диапазон: с 1000-01-01 00:00.0 по 9999-12-31 23:59:59.999999 F (точность): 0 (1s) до 6 (1μs)

source: Range: 1000-01-01 to 9999-12-31
ru: Диапазон: с 1000-01-01 по 9999-12-31

source: Range: 1970-01-01 00:00:01.0 to 2038-01-19 03:14:07.999999 F (precision): 0 (1s) to 6 (1µs)
ru: Диапазон: с 1970-01-01 00:00:01.0 по 2038-01-19 03:14:07.999999 F (точность): 0 (1s) до 6 (1μs)

source: Reading...
ru: Чтение...

source: Refresh Databases
ru: Обновить базы данных

source: Refresh List
ru: Обновить список

source: Relations
ru: Связи

source: Relations for table: %@
ru: Связи таблицы: %@

source: Reload Bundles
ru: Перезагрузить пакеты

source: Reloading data...
ru: Перезагрузка данных...

source: Reloading...
ru: Перезагрузка...

source: Remote Error
ru: Внешняя ошибка

source: Remove
ru: Удалить

source: Remove All
ru: Удалить все

source: Remove all query favorites?
ru: Удалить все избранные запросы?

source: Remove selected Bundle?
ru: Удалить выбранный пакет?

source: Remove selected content filters?
ru: Удалить выбранные фильтры содержимого?

source: Remove selected query favorites?
ru: Удалить выбранные избранные запросы?

source: Removing field...
ru: Удаление поля...

source: Removing index...
ru: Удаление индекса...

source: Rename database '%@' to:
ru: Переименовать базу данных '%@' в:

source: Rename Function...
ru: Переименовать функцию...

source: Rename Procedure...
ru: Переименовать процедуру...

source: Rename Table...
ru: Переименовать таблицу...

source: Rename View...
ru: Переименовать представление...

source: Repair %@
ru: Исправление %@

source: Repair Selected Items
ru: Исправить выбранные элементы

source: Repair Table
ru: Исправить таблицу

source: Repair table failed.
ru: Не удалось исправить таблицу.

source: Replace
ru: Заменить

source: Replace Entire Content
ru: Заменить всё содержимое

source: Replace Selection
ru: Заменить выделенное

source: Represents a collection of LineStrings.
ru: Представляет собой коллекцию LineStrings.

source: required
ru: требуется

source: Reset AUTO_INCREMENT after deletion (only for Delete ALL ROWS IN TABLE)?
ru: Сбросить AUTO_INCREMENT после удаления (только при условии удаления всех строк из таблицы)?

source: Delete Selected Row
ru: Удалить выбранную строку

source: Delete Selected Rows
ru: Удалить выбранные строки

source: Delete ALL ROWS IN TABLE
ru: Удалить ALL ROWS IN TABLE

source: Restoring session...
ru: Восстановление сессии...

source: Return Type
ru: Возвращает

source: return type: %@
ru: возвращает тип: %@

source: row
ru: строка

source: rows
ru: строки

source: Rows %@ - %@ from filtered matches
ru: Строки %1$@ - %2$@ из отфильтрованных данных

source: Rows %@ - %@ of %@%@ from table
ru: Строки %1$@ - %2$@ из %3$@%4$@ из таблицы

source: rows: %@
ru: строк: %@

source: rows: ~%@
ru: строк: ~%@

source: Run All
ru: Выполнить все

source: Run All Queries
ru: Выполнить все запросы

source: Run Current
ru: Выполнить текущий

source: Run Current Query
ru: Выполнить текущий запрос

source: Run Custom Query
ru: Выполнить пользовательский запрос

source: Run Previous
ru: Выполнить предыдущий

source: Run Previous Query
ru: Выполнить предыдущий запрос

source: Run Selected Text
ru: Выполнить выбранный текст

source: Run Selection
ru: Выполнить выделенное

source: Running query %i of %lu...
ru: Выполняется запрос %1$i из %2$lu...

source: Running query %ld of %lu...
ru: Выполняется запрос %1$ld из %2$lu...

source: Running query...
ru: Выполнение запроса...

source: Save
ru: Сохранить

source: Save All to Favorites
ru: Сохранить все в Избранное

source: Save As...
ru: Сохранить как...

source: save BLOB as dat file
ru: сохранить BLOB как dat файл

source: save BLOB as image file
ru: сохранить BLOB как файл изображения

source: Save Current Query to Favorites
ru: Сохранить текущий запрос в Избранное

source: Save Page As…
ru: Сохранить страницу как…

source: Save Queries…
ru: Сохранить запросы…

source: Save Query…
ru: Сохранить запрос…

source: Save Selection to Favorites
ru: Сохранить выделенное в Избранное

source: Save View As...
ru: Сохранить представление как...

source: Schema path:
ru: Путь схемы:

source: Search in MySQL Documentation
ru: Искать в документации MySQL

source: Search in MySQL Help
ru: Поиск по MySQL справке

source: Select Active Query
ru: Выделить активный запрос

source: Select Database
ru: Выберите базу данных

source: selected items
ru: выбранные элементы

source: Selected Rows (CSV)
ru: Выбранные строки (CSV)

source: Selected Rows (SQL)
ru: Выбранные строки (SQL)

source: Selected Rows (TSV)
ru: Выбранные строки (TSV)

source: Selected Text
ru: Выбранный текст

source: Selection
ru: Выделенное

source: sequelace URL scheme command not supported.
ru: Команда Sequel Ace URL схемы не поддерживается.

source: sequelace URL Scheme Error
ru: Ошибка URL схемы Sequel Ace

source: Server
ru: Сервер

source: Server Default (%@)
ru: Настройки сервера по умолчанию (%@)

source: Server Processes on %@
ru: Процессы сервера %@

source: Session
ru: Сессия

source: Show as HTML
ru: Показать как HTML

source: Show as HTML Tooltip
ru: Показывать как HTML-подсказку

source: Show as Text Tooltip
ru: Показывать как текстовую подсказку

source: Show Console
ru: Открыть консоль

source: Show Create Function Syntax...
ru: Показать запрос создания функции...

source: Show Create Procedure Syntax...
ru: Показать запрос создания процедуры...

source: Show Create Syntaxes...
ru: Показать запросы создания...

source: Show Create Table Syntax...
ru: Показать запрос создания таблицы...

source: Show Create View Syntax...
ru: Показать запрос создания представления...

source: Show Detail
ru: Показать сведения

source: Show MySQL help for %@
ru: Показать MySQL справку для %@

source: Show Navigator
ru: Показать Навигатор

source: Show Tab Bar
ru: Показывать панель вкладок

source: Show Toolbar
ru: Показать панель инструментов

source: Showing %lu of %lu processes
ru: Показано %1$lu из %2$lu процессов

source: Shutdown
ru: Выключить

source: Shutdown failed!
ru: Сбой выключения!

source: Signed: %@ to %@ Unsigned: %@ to %@
ru: Со знаком: %1$@ в %2$@ Без знака: %3$@ в %4$@

source: size: %@
ru: размер: %@

source: Skip existing
ru: Пропустить существующий

source: Skip problems
ru: Проигнорировать проблемы

source: Beta Build
ru: Предварительная версия

source: Socket connection failed!
ru: Ошибка соединения через сокет!

source: Socket not found!
ru: Сокет не найден!

source: Some of the target export folders are not writable. Please select a new export location and try again.
ru: Некоторые папки для экспорта недоступны для записи. Пожалуйста, выберите новое место для экспорта и повторите попытку.

source: Some of the target export folders no longer exist. Please select a new export location and try again.
ru: Некоторые папки для экспорта больше не существуют. Пожалуйста, выберите новое место для экспорта и повторите попытку.

source: Sorting table...
ru: Сортировка таблицы...

source: Connection Secured via SSL
ru: Соединение защищено через SSL

source: SSH Connected
ru: SSH подключён

source: SSH connecting...
ru: Подключение SSH...

source: SSH Connecting…
ru: Подключение SSH…

source: SSH connection failed!
ru: Сбой SSH соединения!

source: SSH Disconnected
ru: SSH отключён

source: SSH Key not found
ru: SSH ключ не найден

source: SSH port forwarding failed
ru: Ошибка перенаправления SSH порта

source: SSL Certificate Authority File not found
ru: Файл центра сертификации SSL не найден

source: SSL Certificate File not found
ru: Файл сертификата SSL не найден

source: SSL connection not established
ru: SSL соединение не установлено

source: SSL Key File not found
ru: Файл SSL ключа не найден

source: Standard memory
ru: Стандартное использование памяти

source: started
ru: запущено

source: Stop
ru: Стоп

source: Stop queries
ru: Остановить запросы

source: Stop query
ru: Остановить запрос

source: Stores a date and time of day as seconds since the beginning of the UNIX epoch (1970-01-01 00:00:00). The values displayed/stored are affected by the connection's @@time_zone setting. The representation is the same as for DATETIME. Invalid values, as well as "second zero", are converted to 0000-00-00 00:00:00.0. Fractional seconds were added in MySQL 5.6.4 with a precision down to microseconds (6), specified by F. Some additional rules may apply.
ru: Хранит дату и время в виде секунд, прошедших с начала UNIX эпохи (01.01.1970 00:00). Отображаемые/сохраненные значения зависят от настройки часового пояса (@@time_zone) для соедин ения. Отображается совпадает с DATETIME. Недопустимые значения, а также «второй ноль» конвертируются в 0000-00-00 00:00:00.0. Доли секунды были добавлены в MySQL 5.6.4 и их точность может настраиваться в диапазоне от 0 (секунды) до 6 (микросекунды). Также могут применяться некоторые дополнительные правила.

source: Stores a date and time of day. The representation is YYYY-MM-DD HH:MM:SS[.I*], I being fractional seconds. The value is not affected by any time zone setting. Invalid values are converted to 0000-00-00 00:00:00.0. Fractional seconds were added in MySQL 5.6.4 with a precision down to microseconds (6), specified by F.
ru: Хранит дату и время. Представление ГГГГ-ММ-ДД ЧЧ:ММ:СС[.|*], может содержать дроби секунды. Это значение не зависит от настройки часового пояса. Неверные значения преобразовываются в 0000-0000:00:00.0. В MySQL 5.6.4 были добавлены дробные секунды с точностью до микросекунд (6).

source: Stores a time of day, duration or time interval. The representation is HH:MM:SS[.I*], I being fractional seconds. The value is not affected by any time zone setting. Invalid values are converted to 00:00:00. Fractional seconds were added in MySQL 5.6.4 with a precision down to microseconds (6), specified by F.
ru: Хранит время, продолжительность или интервал времени. Представление ЧЧ:ММ:СС[.|*] может содержать дроби секунды. Это значение не зависит от настройки часового пояса. Неверные значения преобразовываются в 00:00:00. В MySQL 5.6.4 были добавлены дробные секунды с точностью до микросекунд (6).

source: Structure
ru: Структура

source: Successfully analyzed all selected items.
ru: Все выбранные элементы успешно проанализированы.

source: Successfully analyzed table.
ru: Таблица успешно проанализирована.

source: Successfully flushed all selected items.
ru: Все выбранные элементы успешно очищены.

source: Successfully flushed privileges.
ru: Привилегии успешно обновлены.

source: Successfully flushed table.
ru: Таблица успешно очищена.

source: Successfully optimized all selected items.
ru: Выбранные выбранные элементы успешно оптимизированы.

source: Successfully optimized table.
ru: Таблица успешно оптимизирована.

source: Successfully repaired all selected items.
ru: Все выбранные элементы успешно исправлены.

source: Successfully repaired table.
ru: Таблица исправлена.

source: Switch to the Run Query tab
ru: Переключиться на вкладку пользовательских запросов

source: Switch to the Table Content tab
ru: Переключиться на вкладку содержимого таблицы

source: Switch to the Table Info tab
ru: Переключиться на вкладку сводки таблицы

source: Switch to the Table Relations tab
ru: Переключиться на вкладку связей таблицы

source: Switch to the Table Structure tab
ru: Переключиться на вкладку структуры таблицы

source: Switch to the Table Triggers tab
ru: Переключиться на вкладку триггеров таблицы

source: Switch to the User Manager tab
ru: Переключиться на вкладку управления пользователями

source: Syntax for %@ table copied
ru: Запрос создания для таблицы %@ скопирован

source: table
ru: таблица

source: Table
ru: Таблица

source: Table %lu of %lu (%@): Fetching data...
ru: Таблица %1$lu из %2$lu (%3$@): Получение данных...

source: Table %lu of %lu (%@): Fetching relations data...
ru: Table %1$lu of %2$lu (%3$@): Fetching relations data...

source: Table %lu of %lu (%@): Writing data...
ru: Таблица %1$lu из %2$lu (%3$@): Запись данных...

source: Table changed
ru: Таблица изменена

source: Table checksum
ru: Контрольная сумма таблицы

source: Table checksum: %@
ru: Контрольная сумма таблицы: %@

source: Table Content
ru: Содержимое таблицы

source: Table Content (CSV)
ru: Содержимое таблицы (CSV)

source: Table Content (SQL)
ru: Содержимое таблицы (SQL)

source: Table Content (TSV)
ru: Содержимое таблицы (TSV)

source: Table History
ru: История таблиц

source: Table Info
ru: Сводка

source: TABLE INFORMATION
ru: О ТАБЛИЦЕ

source: Table Information
ru: Информация о таблице

source: Table must have a name.
ru: У таблицы должно быть имя.

source: Table Preferences
ru: Настройки таблиц

source: Table Relations
ru: Связи таблицы

source: Table Row changed
ru: Изменена строка таблицы

source: Table Structure
ru: Структура таблицы

source: Table Triggers
ru: Триггеры таблицы

source: Table: %@
ru: Таблица: %@

source: Tables
ru: Таблицы

source: tables
ru: таблицы

source: TABLES
ru: ТАБЛИЦЫ

source: TABLES & VIEWS
ru: ТАБЛИЦЫ и ПРЕДСТАВЛЕНИЯ

source: Testing connection...
ru: Проверка соединения...

source: Testing MySQL...
ru: Проверка MySQL...

source: Testing SSH...
ru: Проверка SSH...

source: Text
ru: Текст

source: Text is too long. Maximum text length is set to %llu.
ru: Текст слишком длинный. Длина ограничена %llu.

source: Thanks for updating Sequel Ace!
ru: Спасибо за обновление Sequel Ace!

source: The Bundle ‘%@’ already exists.
ru: Пакет ‘%@’ уже существует.

source: The Bundle ‘%@’ has no UUID which is necessary to identify installed Bundles.
ru: У пакета ‘%@’ нет UUID, который необходим для идентификации установленных пакетов.

source: ‘%@’ Bundle contains legacy components
ru: ‘%@’ пакет содержит устаревшие компоненты

source: In these files: %@ Do you still want to install the bundle?
ru: В этих файлах: %@ Вы всё ещё хотите установить пакет?

source: The chosen file %@ contains ‘%@’ data.
ru: Выбранный файл “%1$@” содержит данные ‘%2$@’.

source: The color theme ‘%@’ already exists.
ru: Цветовая тема ‘%@` уже существует.

source: The connection is busy. Please wait and try again.
ru: Соединение занято. Пожалуйста, подождите и повторите попытку.

source: The CSV file you selected could not be found or read.
ru: Не удалось найти или прочитать выбранный CSV файл.
