Repository: c24-fewo/sequel-ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: ru

source: The CSV was read as containing more than 512 columns, more than the maximum columns permitted for speed reasons by Sequel Ace. This usually happens due to errors reading the CSV; please double-check the CSV to be imported and the line endings and escape characters at the bottom of the CSV selection dialog.
ru: CSV содержит более 512 колонок, что превышает максимальное разрешённое число (это влияет на производительность Sequel Ace). Обычно это происходит из-за ошибок чтения CSV; пожалуйста, перепроверьте содержимое CSV, а также символы окончания и экранирования строк, указываемые внизу окна выбора CSV.

source: The current color theme is unsaved. Do you want to proceed without saving it?
ru: Текущая цветовая схема не сохранена. Продолжить без сохранения?

source: The following default Bundles were updated: %@ Your modifications were stored as “(user)”.
ru: Следующие базовые наборы обновились: %@ Ваши изменения были сохранены как “(user)”.

source: The following error occurred during the export process: %@
ru: При экспорте произошла ошибка: %@

source: The following error occurred during the import process: %@
ru: При импорте произошла ошибка: %@

source: The foreign key relationship '%@' has a dependency on index '%@'. This relationship must be removed before the index can be deleted. Are you sure you want to continue to delete the relationship and the index? This action cannot be undone.
ru: The foreign key relationship '%1$@' has a dependency on index '%2$@'. This relationship must be removed before the index can be deleted. Are you sure you want to continue to delete the relationship and the index? This action cannot be undone.

source: The list of tables has changed
ru: Список таблиц изменился

source: The name '%@' is already used.
ru: Имя '%@' уже используется.

source: The row was not written to the MySQL database. You probably haven't changed anything. Reload the table to be sure that the row exists and use a primary key for your table. (This error can be turned off in the preferences.)
ru: Строка не была записана в базу данных MySQL. Возможно, вы ничего не изменили. Перезагрузите таблицу, чтобы убедиться, что она существует и используйте первичный ключ в вашей таблицы. (Эту ошибку можно отключить в настройках)

source: The selected relation couldn't be deleted. MySQL said: %@
ru: Выбранная связь не может быть удалена. MySQL сообщил: %@

source: The selected trigger couldn't be deleted. MySQL said: %@
ru: Выбранный триггер не может быть удалён. MySQL сообщил: %@

source: The specified relation could not be created. MySQL said: %@
ru: Не получается установить связь. MySQL сообщил: %@

source: The specified trigger was unable to be created. MySQL said: %@
ru: Не получается создать указанный триггер. MySQL сообщил: %@

source: The SQL file uses utf8mb4 encoding, but your MySQL version only supports the limited utf8 subset. You can continue the import, but any non-BMP characters in the SQL file (eg. some typographic and scientific special characters, archaic CJK logograms, emojis) will be unrecoverably lost!
ru: SQL-файл использует кодировку utf8mb4, но ваша версия MySQL поддерживает только ограниченный набор подмножеств utf8. Вы можете продолжить импорт, но любые не-BMP символы в SQL файле (например, некоторые типографические и научные специальные символы, древние логотипы CJK, смайлики) будут безвозвратно потеряны!

source: The SQL file you selected could not be found or read.
ru: Не удалось найти или прочитать выбранный SQL файл.

source: The SSH password could not be loaded from the keychain; please enter the SSH password for %@:
ru: SSH пароль не может быть загружен из Связки ключей; пожалуйста, введите SSH пароль для %@:

source: The SSH password could not be loaded; please enter the SSH password for %@:
ru: SSH пароль не может быть загружен из Связки ключей; пожалуйста, введите SSH пароль для %@:

source: The SSH Tunnel has unexpectedly closed.
ru: SSH туннель неожиданно закрылся.

source: The SSH Tunnel was unable to bind to the local port. This error may occur if you already have an SSH connection to the same server and are using a 'LocalForward' setting in your SSH configuration. Would you like to fall back to a standard connection to localhost in order to use the existing tunnel?
ru: Не удалось пробросить туннель SSH через локальный порт. Эта ошибка может произойти, если у вас уже есть SSH соединение с тем же сервером и вы используете параметр 'LocalForward' в вашей конфигурации SSH. Вы хотите вернуться к стандартному соединению с локальным хостом, чтобы использовать существующий туннель?

source: The SSH Tunnel was unable to connect to host %@, or the request timed out. Be sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %ld seconds).
ru: The SSH Tunnel was unable to connect to host %1$@, or the request timed out. Be sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %2$ld seconds).

source: The table data couldn't be loaded presumably due to used filter clause. MySQL said: %@
ru: Не получается загрузить данные таблицы предположительно из-за настроек фильтра. MySQL сообщил: %@

source: The table data couldn't be loaded. MySQL said: %@
ru: Не получается загрузить данные таблицы. MySQL сообщил: %@

source: No directory selected. Please select a new export location and try again.
ru: Каталог не выбран. Пожалуйста, выберите новое место для экспорта и повторите попытку.

source: No directory selected.
ru: Каталог не выбран.

source: Please select a new export location and try again.
ru: Пожалуйста, выберите новое место для экспорта и повторите попытку.

source: Theme Name:
ru: Название темы:

source: Themes Installation Error
ru: Ошибка установки тем

source: There have been errors while copying table content. Please check the new table.
ru: Произошла ошибка при копировании содержимого таблицы. Пожалуйста, проверьте новую таблицу.

source: Cannot duplicate a table with triggers to a different database.
ru: Невозможно дублировать таблицу с триггерами в другую базу данных.

source: There were no errors.
ru: Без ошибок.

source: This index cannot be deleted, because it is used by an existing foreign key relationship. Please remove the relationship, before trying to remove this index. MySQL said: %@
ru: Этот индекс не может быть удалён, так как он используется существующей связью внешнего ключа. Пожалуйста, удалите эту связь прежде чем пытаться удалить этот индекс. MySQL сообщил: %@

source: This is an alias for BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE.
ru: Это псевдоним для BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE.

source: This is an alias for DECIMAL.
ru: Это псевдоним для DECIMAL.

source: This is an alias for DOUBLE, unless REAL_AS_FLOAT is configured.
ru: Это псевдоним для DOUBLE, пока не задан REAL_AS_FLOAT.

source: This is an alias for DOUBLE.
ru: Это псевдоним для DOUBLE.

source: This is an alias for TINYINT(1).
ru: Это псевдоним для TINYINT(1).

source: This is the default collation of database %@.
ru: Это сортировка по умолчанию для базы данных %@.

source: This is the default collation of encoding %@.
ru: Это сортировка по умолчанию для кодировки %@.

source: This is the default collation of table %@.
ru: Это сортировка по умолчанию для таблицы %@.

source: This is the default collation of this server.
ru: Это базовая сортировка для этого сервера.

source: This is the default encoding of database %@.
ru: Это кодировка по умолчанию для базы данных %@.

source: This is the default encoding of table %@.
ru: Это кодировка по умолчанию для таблицы %@.

source: This is the default encoding of this server.
ru: Это базовая кодировка для этого сервера.

source: This table currently does not support relations. Only tables that use the InnoDB storage engine support them.
ru: В настоящее время эта таблица не поддерживает связи. Их поддерживают только таблицы, использующие движок хранилища InnoDB.

source: Time
ru: Время

source: Triggers
ru: Триггеры

source: Triggers for table: %@
ru: Триггеры для таблицы: %@

source: Truncate
ru: Очистить

source: Truncate selected tables?
ru: Очистить выбранные таблицы?

source: Truncate Table...
ru: Очистить таблицу...

source: Truncate table '%@'?
ru: Очистить таблицу '%@'?

source: Truncate Tables
ru: Очистить таблицу

source: Type
ru: Тип

source: Type Declaration:
ru: Объявление типа:

source: Unable to add index
ru: Не удаётся добавить индекс

source: Unable to analyze selected items
ru: Не удаётся проанализировать выбранные элементы

source: Unable to analyze table
ru: Не удаётся проанализировать таблицу

source: Unable to check selected items
ru: Не удается проверить выбранные элементы

source: Unable to check table
ru: Не удается проверить таблицу

source: Unable to connect to host %@ because access was denied. Double-check your username and password and ensure that access from your current location is permitted. MySQL said: %@
ru: Не удаётся подключиться к узлу %1$@ из-за запрета доступа. Перепроверьте имя пользователя и пароль и убедитесь, что доступ к текущему ресурсу разрешён. MySQL сообщил: %2$@

source: Unable to connect to host %@ because the port connection via SSH was refused. Please ensure that your MySQL host is set up to allow TCP/IP connections (no --skip-networking) and is configured to allow connections from the host you are tunnelling via. You may also want to check the port is correct and that you have the necessary privileges. Checking the error detail will show the SSH debug log which may provide more details. MySQL said: %@
ru: Не удаётся соединиться с узлом %1$@ из-за отказа в подключении к порту через SSH. Пожалуйста, убедитесь, что у вашего MySQL включено TCP/IP соединение (нет ключа --skip-networking при запуске) и настроено разрешение соединений с того хоста, пропущенного через туннель. Вы также можете проверить правильность порта и наличие необходимых привилегий. Ошибка добавлена в отладочный SSH журнал, где вы можете найти более детальную информацию для анализа. MySQL сообщил: %2$@

source: Unable to connect to host %@, or the request timed out. Be sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %ld seconds). MySQL said: %@
ru: Не удалось подключиться к узлу %1$@ или время ожидания истекло. Убедитесь в правильности адреса и наличии необходимых привилегий или попробуйте увеличить время ожидания соединения (сейчас %2$ld сек.). MySQL сообщил: %3$@

source: Unable to connect via the socket, or the request timed out. Double-check that the socket path is correct and that you have the necessary privileges, and that the server is running. MySQL said: %@
ru: Не удается подключиться через сокет или время ожидания запроса истекло. Перепроверьте путь к сокету и наличии необходимых прав, а также запущен ли сервер. MySQL сообщил: %@

source: Unable to copy database
ru: Не удаётся переименовать базу данных

source: Unable to delete index
ru: Не удаётся удалить индекс

source: Unable to delete relation
ru: Не удаётся удалить связь

source: Unable to delete trigger
ru: Не удаётся удалить триггер

source: Unable to flush selected items
ru: Невозможно очистить выбранные элементы

source: Unable to flush table
ru: Не удаётся очистить таблицу

source: Unable to get list of users
ru: Не удаётся получить список пользователей

source: Unable to kill connection
ru: Не удаётся разорвать соединение

source: Unable to kill query
ru: Не удалось прервать запрос

source: Unable to optimze selected items
ru: Не удаётся оптимизировать выбранные элементы

source: Unable to optimze table
ru: Не удалось оптимизировать таблицу

source: Unable to perform the checksum
ru: Не удалось вычислить контрольную сумму

source: Unable to remove host
ru: Не удаётся удалить узел

source: Unable to rename database
ru: Не удаётся переименовать базу данных

source: Unable to repair selected items
ru: Не удаётся восстановить выбранные элементы

source: Unable to repair table
ru: Не удаётся исправить таблицу

source: Unable to select database %@. Please check you have the necessary privileges to view the database, and that the database still exists.
ru: Невозможно выбрать базу данных %@. Пожалуйста, проверьте наличие необходимых прав на просмотр базы данных и её наличие.

source: Unable to write row
ru: Не удается записать строку

source: Unexpected number of rows removed!
ru: Удалено неожиданное количество строк!

source: Unknown file format
ru: Неизвестный формат файла

source: Unsaved changes
ru: Несохранённые изменения

source: Unsaved Theme
ru: Несохранённая тема

source: Unsupported configuration!
ru: Неподдерживаемая конфигурация!

source: Unsupported version for export settings!
ru: Неподдерживаемая для экспорта настроек версия!

source: Untitled
ru: Без названия

source: Untitled %ld
ru: Безымянный %ld

source: Up to %@ bytes (16 MiB)
ru: До %@ байт (16 МиБ)

source: Up to %@ bytes (4 GiB)
ru: До %@ байт (4 ГиБ)

source: Up to %@ characters (16 MiB)
ru: До %@ символов (16 МиБ)

source: Up to %@ distinct members (<%@ in practice) 1-2 bytes storage
ru: Up to %1$@ distinct members (<%2$@ in practice) 1-2 bytes storage

source: Up to 255 bytes
ru: До 255 байт

source: Up to 255 characters
ru: До 255 символов

source: Update
ru: Обновить

source: updated: %@
ru: обновлено: %@

source: Updating field data...
ru: Обновление данных поля...

source: URL scheme command %@ unsupported
ru: Команда URL схемы %@ не поддерживается

source: Use 127.0.0.1
ru: Использовать 127.0.0.1

source: Use Standard Connection
ru: Использовать стандартное соединение

source: User has no hosts
ru: Для пользователя не указан узел

source: User-defined value
ru: Пользовательское значение

source: Users
ru: Пользователи

source: Value will be imported as MySQL NULL
ru: Значение будет импортировано как MySQL NULL

source: Variable
ru: Переменная

source: version
ru: версия

source: Version
ru: Версия

source: view
ru: представление

source: View full release notes
ru: Просмотреть все примечания к версии

source: VIEW INFORMATION
ru: О ПРЕДСТАВЛЕНИИ

source: View Source
ru: Исходный код

source: View Structure
ru: Структура представления

source: views
ru: представления

source: Warning
ru: Предупреждение

source: We've made a few changes but we thought you should know about one particularly important one:
ru: Мы внеси некоторые изменения и думаем, что вы должны узнать о наиболее важном:

source: We've made a few changes but we thought you should know about some particularly important ones:
ru: Мы внеси некоторые изменения и думаем, что вы должны узнать о наиболее важных:

source: WHERE clause not valid
ru: Недопустимое условие WHERE

source: WHERE NOT query
ru: WHERE NOT запрос

source: WHERE query
ru: WHERE запрос

source: Working...
ru: Обработка...

source: Writing data...
ru: Запись данных...

source: Writing...
ru: Запись...

source: Wrong data format or password.
ru: Неверный формат данных или пароль.

source: Wrong data format.
ru: Неверный формат данных.

source: Wrong SPF content type!
ru: Неправильный SPF тип содержимого!

source: Year
ru: Год

source: You can only copy single rows.
ru: Вы можете скопировать только одну строку.

source: You can't hide blob and text fields when working with tables without index.
ru: Вы не можете скрыть блоки и текстовые поля при работе с таблицами без индекса.

source: You cannot delete the last field in a table. Delete the table instead.
ru: Вы не можете удалить последнее поле в таблице. Вместо этого удалите саму таблицу.

source: You requested that the connection should be established using SSL, but MySQL made the connection without SSL. This may be because the server does not support SSL connections, or has SSL disabled; or insufficient details were supplied to establish an SSL connection. This connection is not encrypted.
ru: Вы инициализировали установку соединения с помощью SSL, но MySQL подключился без SSL. Это может быть потому, что сервер не поддерживает SSL-соединения, или на нём SSL отключено, или задано недостаточно параметров для установки SSL-соединения. Это соединение не зашифровано.

source: %@ already exists. Do you want to replace it?
ru: %@ уже существует. Вы хотите заменить его?

source: %@ Bundle
ru: Пакет %@

source: %@ could not be created
ru: %@ не может быть создан

source: %@ is not a valid client certificate file.
ru: %@ не является допустимым файлом сертификата клиента.

source: %@ is not a valid private key file.
ru: %@ не является допустимым файлом приватного ключа.

source: App Sandbox Issue
ru: Проблема в Sandbox приложения

source: Stale Bookmarks
ru: Старые закладки

source: App Sandbox Info
ru: Информация о песочнице приложения

source: File Selection Error
ru: Ошибка выбора файла

source: The selected file is not a valid file. Please try again. Class: %@
ru: Выбранный файл не является допустимым. Пожалуйста, попробуйте ещё раз. Класс: %@

source: SSH Tunnel Debugging Info
ru: Отладочная информация SSH туннеля

source: You have stale secure bookmarks: %@ Would you like to re-request access now?
ru: Обнаружено, что доступ к некоторым защищенным закладкам просрочен: %@ Хотите повторно запросить доступ к ним сейчас?

source: You have missing secure bookmarks: %@ Would you like to request access now?
ru: Обнаружено отсутствие некоторых защищенных закладок: %@ Хотите запросить доступ к ним сейчас?

source: Use known hosts from ssh config (ADVANCED)
ru: Использовать известные хосты из SSH настроек (ПРОДВИНУТЫЙ РЕЖИМ)

source: Yes
ru: Да

source: A reminder of your stale secure bookmarks:<br /><br />%@<br />
ru: Напоминание об устаревших защищенных закладках:<br /><br />%@<br />

source: Stale Secure Bookmarks
ru: Старые безопасные закладки

source: Export Error
ru: Ошибка экспорта

source: Error while writing to the export file. Could not open file: %@
ru: Ошибка записи в файл экспорта. Не удалось открыть файл: %@

source: User Data Error
ru: Ошибка данных пользователя

source: Please choose a file or folder to grant Sequel Ace access to.
ru: Пожалуйста, выберите файл или папку для предоставления доступа Sequel Ace.

source: Please choose your ssh config files(s)
ru: Пожалуйста, выберите файл(ы) SSH конфигурации

source: Please choose your known hosts file
ru: Пожалуйста, выберите файл известных узлов

source: Invalid JSON
ru: Неверный формат JSON

source: Applying syntax highlighting...
ru: Применение подсветки синтаксиса...

source: Couldn't launch task. Exception reason: %@ ENV length: %lu
ru: Не удалось запустить задачу. Причина исключения: %@ ENV: %lu

source: New Connection Error
ru: Ошибка нового соединения

source: A new version is available
ru: Доступна новая версия

source: Download
ru: Загрузить

source: Version %@ is available. You are currently running %@
ru: Доступна версия %@. Сейчас вы используете %@

source: Download Progress
ru: Прогресс загрузки

source: Calculating time remaining...
ru: Оценка оставшегося времени...

source: Downloading Sequel Ace - %@
ru: Загрузка Sequel Ace - %@

source: About %.1f seconds left
ru: Осталось приблизительно секунд: %.1f

source: Download Failed
ru: Ошибка загрузки

source: Only available for GitHub downloads
ru: Загрузить возможно только из GitHub

source: WARNING: Setting the auto-complete delay to 0.0 can result in strange output.
ru: ВНИМАНИЕ: Нулевая задержка подсказок ввода может стать причиной странного результата.

source: %@ of %@
ru: %@ из %@

source: time_zone will be set to SYSTEM.
ru: часовой пояс будет установлен в SYSTEM.

source: Check for Updates...
ru: Проверить наличие обновлений...

source: GitHub Request Failed
ru: Ошибка запроса к GitHub

source: No Newer Release Available
ru: Нет более новых версий

source: You are currently running the latest release.
ru: Вы используете самую свежую версию.

source: Never show this again
ru: Больше не показывать это

source: The current field "%@" is a generated column and therefore cannot be edited.
ru: Текущее поле "%@" является вычисленным столбцом и поэтому не может быть изменено.

source: The use of the "default" column has changed since the last version of Sequel ACE: - No default value : Leave it blank. - String value : Use single '' or double quotes "" if you want an empty string or to wrap a string - Expression : Use parentheses (). Except for the TIMESTAMP and DATETIME columns where you can specify the CURRENT_TIMESTAMP function without enclosing parentheses.
ru: Использование колонки "default" изменилось с момента выхода последней версии Sequel ACE: - Если нет значения по умолчанию, то оставьте его пустым. - Для строкового значения одинарный кавычки ('…') или двоные кавычки для пустой строки или переноса строки ("…") - Для ввода выражения используйте скобки (…). Для колонок TIMESTAMP и DATETIME можно указать функцию CURRENT_TIMESTAMP без скобок.

source: Pin View
ru: Закрепить представление

source: Pin Table
ru: Закрепить таблицу

source: Pin Procedure
ru: Закрепить процедуру

source: Pin Function
ru: Закрепить функцию

source: Unpin View
ru: Открепить представление

source: Unpin Table
ru: Открепить таблицу

source: Unpin Procedure
ru: Открепить процедуру

source: Unpin Function
ru: Открепить функцию

source: PINNED
ru: ЗАКРЕПЛЁННЫЕ

source: Copy Table Name
ru: Скопировать имя таблицы

source: LaunchFavorite URL Scheme Error
ru: Ошибка запуска Избранной URL схемы
