Repository: c24-fewo/sequel-ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: ru

source: Are you sure you want to delete the selected %@? This operation cannot be undone.
ru: Вы уверены, что хотите удалить выбранное(ые) %@? Это действие необратимо.

source: Are you sure you want to delete the selected %ld rows from this table? This action cannot be undone.
ru: Вы уверены, что хотите удалить %ld строк этой таблицы? Это действие необратимо.

source: Are you sure you want to delete the selected relations? This action cannot be undone.
ru: Вы действительно хотите удалить выбранную связь? Это действие необратимо.

source: Are you sure you want to delete the selected row from this table? This action cannot be undone.
ru: Вы уверены, что хотите удалить выбранную строку этой таблицы? Это действие необратимо.

source: Are you sure you want to delete the selected triggers? This action cannot be undone.
ru: Вы уверены, что хотите выбранные триггеры "%@'? Это действие необратимо.

source: Are you sure you want to kill connection ID %lld? Please be aware that continuing to kill this connection may result in data corruption. Please proceed with caution.
ru: Вы уверены, что хотите разорвать соединение ID %lld? Имейте в виду, что разрыв этого соединения может привести к повреждению данных. Пожалуйста, будьте осторожны.

source: Are you sure you want to kill the current query executing on connection ID %lld? Please be aware that continuing to kill this query may result in data corruption. Please proceed with caution.
ru: Вы уверены, что хотите принудительно завершить текущий запрос в подключении ID %lld? Имейте в виду, что принудительное завершение этого запроса может привести к повреждению данных. Пожалуйста, проявляйте осторожность.

source: Are you sure you want to move the selected Bundle to the Trash and remove them respectively?
ru: Вы уверены, что хотите удалить выбранный пакет, переместив его в корзину?

source: Are you sure you want to print the current content view of the table '%@'? It currently contains %@ rows, which may take a significant amount of time to print.
ru: Are you sure you want to print the current content view of the table '%1$@'? It currently contains %2$@ rows, which may take a significant amount of time to print.

source: Are you sure you want to remove all of your saved query favorites? This action cannot be undone.
ru: Вы уверены, что хотите удалить все ваши избранные запросы? Это действие необратимо.

source: Autodetect
ru: Автоопределение

source: Background
ru: Фон

source: Backtick Quote
ru: Обратные кавычки

source: BASH Error
ru: Ошибка BASH

source: Browse & Edit Table Content
ru: Просмотр и правка содержимого таблицы

source: build
ru: сборка

source: Build
ru: Сборка

source: Bundle Editor
ru: Редактор пакетов

source: Bundle Error
ru: Ошибка пакета

source: Bundles
ru: Пакеты

source: BUNDLES
ru: ПАКЕТЫ

source: Bundles in category %@
ru: Пакет в категории %@

source: Bundles Installation Error
ru: Ошибка установки пакетов

source: bzip2 compression
ru: bzip2 сжатие

source: Cancel
ru: Отменить

source: Cancel Import
ru: Отменить импорт

source: Cancelling...
ru: Отмена...

source: Cannot save an empty query.
ru: Невозможно сохранить пустой запрос.

source: Caret
ru: Курсор

source: Change
ru: Изменить

source: Change Focus to Table List
ru: Сменить фокус на список таблиц

source: Change table type
ru: Изменить тип таблицы

source: character set client: %@
ru: кодировка: %@

source: Check %@
ru: Проверка %@

source: Check of all selected items successfully passed.
ru: Проверка всех выбранных элементов успешно пройдена.

source: check option: %@
ru: проверка изменений: %@

source: Check Selected Items
ru: Проверить выбранные элементы

source: Check Table
ru: Проверить таблицу

source: Check table failed.
ru: Не получилось проверить таблицу.

source: Check table successfully passed.
ru: Проверка таблицы успешно пройдена.

source: Check View
ru: Проверить представление

source: Checking field data for editing...
ru: Подготовка данных поля к правке...

source: Checksum %@
ru: Контрольная сумма %@

source: Checksum Selected Items
ru: Контрольная сумма выбранных элементов

source: Checksum Table
ru: Контрольная сумма таблицы

source: Checksums of %@
ru: Контрольные суммы для %@

source: Choose Database...
ru: Выберите базу данных...

source: Cleaning up...
ru: Очистка...

source: Clear
ru: Очистить

source: Clear Console
ru: Очистить консоль

source: Clear Global History
ru: Стереть всю историю

source: Clear History for %@
ru: Стереть историю для %@

source: Clear History?
ru: Стереть историю?

source: Clear the console which shows all MySQL commands performed by Sequel Ace
ru: Очистить консоль, которая показывает все команды MySQL, выполненные Sequel Ace

source: Clear the document-based history list
ru: Очистить историю запросов, связанных с документом

source: Clear the global history list
ru: Очистить всю историю запросов

source: Close
ru: Закрыть

source: Close Tab
ru: Закрыть вкладку

source: Close Window
ru: Закрыть окно

source: Collation
ru: Правила сортировки

source: collation connection: %@
ru: сортировка: %@

source: Comment
ru: Комментарий

source: Comment Line
ru: Закомментировать строку

source: Comment Selection
ru: Закомментировать выделенное

source: Connect
ru: Подключиться

source: Connect via socket
ru: Подключиться через сокет

source: Connected
ru: Подключено

source: Connected to %@
ru: Подключено к %@

source: Connected to host, but unable to connect to database %@. Be sure that the database exists and that you have the necessary privileges. MySQL said: %@
ru: После соединения с узлом не удалось подключиться к базе данных %1$@. Убедитесь, что база данных существует и что у вас есть необходимые права. MySQL сообщил: %2$@

source: Connecting...
ru: Подключение...

source: Connecting…
ru: Подключение…

source: Connection data file couldn't be read.
ru: Невозможно прочитать файл с данными для подключения.

source: Connection data file %@ couldn't be read. Please try to save the document under a different name.
ru: Файл с данными для подключения %@ не читается. Пожалуйста, попробуйте сохранить документ под другим именем.

source: Connection failed!
ru: Сбой соединения!

source: Connection file is encrypted
ru: Файл подключения зашифрован

source: Connection succeeded
ru: Соединение успешно установлено

source: Console
ru: Консоль

source: ConsoleLog
ru: Журнал консоли

source: Content
ru: Содержимое

source: Content Filter clause is empty.
ru: Условие фильтра содержимого пусто.

source: Continue
ru: Продолжить

source: Continue to print?
ru: Продолжить печать?

source: Copy as RTF
ru: Скопировать как RTF

source: Copy Create Function Syntax
ru: Скопировать запрос создания функции

source: Copy Create Procedure Syntax
ru: Скопировать запрос создания процедуры

source: Copy Create Syntaxes
ru: Скопировать запросы создания

source: Copy Create Table Syntax
ru: Скопировать запрос создания таблицы

source: Copy Create View Syntax
ru: Скопировать запрос создания представления

source: Copy Variable Name
ru: Скопировать имя переменной

source: Copy Variable Names
ru: Скопировать имена переменных

source: Copy Variable Value
ru: Скопировать значение переменной

source: Copy Variable Values
ru: Скопировать значения переменных

source: Could not export the %@ '%@' because of a permissions error.
ru: Не удалось экспортировать %1$@ '%2$@' из-за ошибки прав доступа.

source: Could not parse file as CSV
ru: Не удалось разобрать CSV файл

source: Could not select database
ru: Не удалось выбрать базу данных

source: Couldn't alter database. MySQL said: %@
ru: Не удалось изменить базу данных. MySQL сообщил: %@

source: Couldn't copy default themes to Application Support Theme folder! Error: %@
ru: Не удалось скопировать базовые темы в папку тем программы! Ошибка: %@

source: Couldn't create '%@'. MySQL said: %@
ru: Не удалось создать '%1$@'. MySQL сообщил: %2$@

source: Couldn't create Application Support Bundle folder! Error: %@
ru: Не удалось создать папку для хранения пакетов! Ошибка: %@

source: Couldn't create Application Support Theme folder! Error: %@
ru: Не удалось создать папку для хранения тем! Ошибка: %@

source: Couldn't create database. MySQL said: %@
ru: Не удалось создать базу данных. MySQL сообщил: %@

source: Couldn't delete '%@'. MySQL said: %@
ru: Не удалось удалить '%1$@'. MySQL сообщил: %2$@

source: Couldn't delete '%@'. Selecting the 'Force delete' option may prevent this issue, but may leave the database in an inconsistent state. MySQL said: %@
ru: Не удалось удалить '%1$@'. Выбор параметра «Принудительное удаление» может решить эту проблему, но при этом привести базу данных в рассогласованное состояние. MySQL сообщил: %2$@

source: Couldn't delete field %@. MySQL said: %@
ru: Не удалось удалить поле %1$@. MySQL сообщил: %2$@

source: Couldn't delete rows. MySQL said: %@
ru: Не удалось удалить строки. MySQL сообщил: %@

source: Couldn't delete the database. MySQL said: %@
ru: Не удалось удалить базу данных. MySQL сообщил: %@

source: Couldn't duplicate '%@'. MySQL said: %@
ru: Не удалось дублировать '%1$@'. MySQL сообщил: %2$@

source: Couldn't flush privileges. MySQL said: %@
ru: Не удалось перезагрузить привилегии. MySQL сообщил: %@

source: Couldn't get create syntax. MySQL said: %@
ru: Не удалось получить запрос создания. MySQL сообщил: %@

source: Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table.
ru: Не удалось загрузить строку. Перезагрузите таблицу, чтобы убедиться, что она существует и используйте первичный ключ в вашей таблицы.

source: Couldn't read the file content of
ru: Не удалось прочитать содержимое файла

source: Couldn't sort column.
ru: Не удалось отсортировать столбец.

source: Couldn't sort table. MySQL said: %@
ru: Не удалось отсортировать таблицу. MySQL сообщил: %@

source: Couldn't write field. MySQL said: %@
ru: Не удалось записать поле. MySQL сообщил: %@

source: Create syntax for
ru: Запрос создания для

source: Create syntax for %@ '%@'
ru: Запрос создания для %1$@ '%2$@ '

source: Create syntaxes for selected items
ru: Запросы создания для выбранных элементов

source: create_options: %@
ru: опции_создания: %@

source: created: %@
ru: создана: %@

source: Creating %@...
ru: Создание %@...

source: Current Line
ru: Текущая строка

source: Current Query
ru: Текущий запрос

source: CURRENT SELECTION
ru: ТЕКУЩИЙ ВЫБОР

source: Current Word
ru: Текущее слово

source: Custom SSH binary enabled. Disable in Preferences to rule out incompatibilities!
ru: Включён пользовательский бинарный SSH. Отключите в настройках для устранения несовместимости!

source: Customize Filename (%@)
ru: Задать имя файла (%@)

source: data access: %@ (%@)
ru: результат: %1$@ (%2$@)

source: Data Table
ru: Содержимое таблицы

source: Data Table Scope commands will run on the Content and Query data tables
ru: Область таблиц данных команды будут нацелены на содержимое таблиц и запросы к ним

source: Database
ru: База данных

source: Database changed
ru: База данных изменена

source: Database must have a name.
ru: База данных должна иметь имя.

source: Database Rename Unsupported
ru: Переименование базы данных не поддерживается

source: Date
ru: Дата

source: Day
ru: День

source: Default
ru: По умолчанию

source: Default (%@)
ru: По умолчанию (%@)

source: Default Bundles Update
ru: Обновление базовых пакетов

source: Default: %@
ru: По умолчанию: %@

source: default_value
ru: значение_по_умолчанию

source: Definer
ru: Создатель

source: definer: %@
ru: создатель: %@

source: Delete
ru: Удалить

source: Delete %@ '%@'?
ru: Удалить %1$@ '%2$@'?

source: Delete Both
ru: Удалить оба

source: Delete database '%@'?
ru: Удалить базу данных '%@'?

source: Delete favorite '%@'?
ru: Удалить избранное '%@'?

source: Delete field '%@'?
ru: Удалить поле '%@'?

source: Delete Function
ru: Удалить функцию

source: Delete Functions
ru: Удалить функции

source: Delete group '%@'?
ru: Удалить группу '%@'?

source: Delete index '%@'?
ru: Удалить индекс '%@'?

source: Delete Items
ru: Удалить элементы

source: Delete Procedure
ru: Удалить процедуру

source: Delete Procedures
ru: Удалить процедуры

source: Delete Relation
ru: Удалить связь

source: Delete relation
ru: Удаление связи

source: Delete Relations
ru: Удалить связь

source: Delete Row
ru: Удалить строку

source: Delete Rows
ru: Удалить строки

source: Delete rows?
ru: Удалить строки?

source: Delete selected %@?
ru: Удалить выделенное %@?

source: Delete selected row?
ru: Удалить выбранную строку?

source: Delete Table...
ru: Удалить таблицу...

source: Delete Tables
ru: Удалить таблицы

source: Delete Trigger
ru: Удалить триггер

source: Delete trigger
ru: Удаление триггера

source: Delete Triggers
ru: Удалить триггеры

source: Delete View
ru: Удалить представление

source: Delete Views
ru: Удалить представления

source: Disabled Cipher Suites
ru: Отключенные наборы шифрования

source: Disables foreign key checks (FOREIGN_KEY_CHECKS) before deletion and re-enables them afterwards.
ru: Временно отключает проверку внешних ключей (FOREIGN_KEY_CHECKS) перед удалением, а затем снова включает её.

source: Discard changes
ru: Откатить изменения

source: Disconnected from %@
ru: Отключено от %@

source: Do you really want to load a SQL file with %@ of data into the Query Editor?
ru: Вы действительно хотите загрузить SQL файл с %@ данными в Редактор запросов?

source: Do you really want to proceed with %@ of data?
ru: Вы действительно хотите продолжить обработку %@ данных?

source: Do you really want to shutdown the server?
ru: Вы действительно хотите выключить сервер?

source: DTD Identifier
ru: Идентификатор DTD

source: Dump of table
ru: Дамп таблицы

source: Dump of view
ru: Дамп представления

source: Dumping...
ru: Запись дампа...

source: Duplicate %@ '%@' to:
ru: Дублировать %1$@ '%2$@' в:

source: Duplicate Function...
ru: Дублировать функцию...

source: Duplicate Host
ru: Дублировать узел

source: Duplicate Procedure...
ru: Дублировать процедуру...

source: Duplicate Table...
ru: Дублировать таблицу...

source: Duplicate User
ru: Дублировать пользователя

source: Duplicate View...
ru: Дублировать представление...

source: Edit Filters…
ru: Редактировать фильтры…

source: Edit row
ru: Изменить строку

source: Edit Table Structure
ru: Изменить структуру таблицы

source: Edit Theme List…
ru: Редактировать список тем…

source: Edit user-defined Filters…
ru: Редактирование пользовательских фильтров…

source: Empty query
ru: Пустой запрос

source: Encoding
ru: Кодировка

source: encoding: %1$@
ru: кодировка: %1$@

source: encoding: %1$@ (%2$@)
ru: кодировка: %1$@ (%2$@)

source: engine: %@
ru: движок: %@

source: Enter your password for the SSH key "%@"
ru: Введите ваш пароль для SSH ключа '%@

source: Entire Content
ru: Всё содержимое

source: Error
ru: Ошибка

source: Error adding field
ru: Ошибка добавления поля

source: Error adding new column
ru: Ошибка при добавлении новой колонки

source: Error adding new table
ru: Ошибка при добавлении новой таблицы

source: Error adding password to Keychain
ru: Ошибка при добавлении пароля в Keychain

source: Error changing field
ru: Ошибка изменения поля

source: Error changing table collation
ru: Ошибка изменения сортировки таблицы

source: Error changing table comment
ru: Ошибка изменения комментария к таблице

source: Error changing table encoding
ru: Ошибка изменения кодировки таблицы

source: Error changing table type
ru: Ошибка изменения типа таблицы

source: Error creating relation
ru: Ошибка при создании связи

source: Error creating trigger
ru: Ошибка создания триггера

source: Error for
ru: Ошибка для

source: Error for “%1$@”: %2$@
ru: Ошибка для “%1$@”: %2$@

source: Error moving field
ru: Ошибка перемещения поля

source: error occurred
ru: произошла ошибка

source: Error reading import file.
ru: Ошибка чтения файла импорта.

source: Error retrieving Keychain item to edit
ru: Ошибка получения элемента Keychain для редактирования

source: Error retrieving table information
ru: Ошибка получения информации о таблице

source: Error retrieving trigger information
ru: Ошибка при получении информации о триггере

source: Error truncating table
ru: Ошибка очистки таблицы

source: Error updating Keychain item
ru: Ошибка при обновлении элемента Keychain

source: Error while analyzing selected items
ru: Ошибка при анализе выбранных элементов

source: Error while checking selected items
ru: Ошибка при проверке выбранных элементов

source: Error while converting color scheme data
ru: Ошибка при преобразовании данных цветовой схемы

source: Error while converting connection data
ru: Ошибка при преобразовании данных подключения

source: Error while converting content filter data
ru: Ошибка при преобразовании данных фильтра содержимого

source: Error while converting query favorite data
ru: Ошибка преобразования данных избранного запроса

source: Error while converting session data
ru: Ошибка при преобразовании данных сессии

source: Error while deleting field
ru: Ошибка при удалении поля

source: Error while duplicating Bundle content.
ru: Ошибка при дублировании содержимого пакета.

source: Error while executing JavaScript BASH command
ru: Ошибка выполнения JavaScript BASH команды

source: Error while fetching the optimized field type
ru: Ошибка поиска оптимизированного типа поля

source: Error while flushing selected items
ru: Ошибка при сбросе выбранных элементов

source: Error while importing table
ru: Ошибка при импорте таблицы

source: Error while installing Bundle
ru: Ошибка установки пакета

source: Error while installing color theme file
ru: Ошибка при установке файла цветовой темы

source: Error while moving %@ to Trash.
ru: Ошибка при отправке %@ в корзину.

source: Error while optimizing selected items
ru: Ошибка при оптимизации выбранных элементов

source: Error while parsing CREATE TABLE syntax
ru: Ошибка разбора запроса CREATE TABLE

source: Error while reading connection data file
ru: Ошибка чтения файла с данными для подключения

source: Error while reading data file
ru: Ошибка при чтении файла данных

source: Error while repairing selected items
ru: Ошибка при восстановлении выбранных элементов

source: Error while saving the Bundle.
ru: Ошибка сохранения пакета.

source: Error while saving %@.
ru: Ошибка при сохранении %@.

source: Errors
ru: Ошибки

source: Example:
ru: Пример:

source: exclude BLOB
ru: исключая BLOB

source: Execution Privilege
ru: Делегированные права

source: execution privilege: %@
ru: права: %@

source: Execution stopped!
ru: Выполнение остановлено!

source: Export Selected...
ru: Экспортировать выбранное...

source: Exporting %@
ru: Экспорт %@

source: Exporting Dot File
ru: Экспорт Dot файла

source: Exporting SQL
ru: Экспорт SQL

source: Extra
ru: Доп.

source: Failed to remove index '%@'
ru: Не удалось удалить индекс '%@'

source: Fatal Error
ru: Критическая ошибка

source: Favorite
ru: Избранное

source: Favorites
ru: Избранное

source: Favorites export error
ru: Ошибка экспорта Избранного

source: Favorites import error
ru: Ошибка импорта Избранного

source: Fetching data...
ru: Получение данных...

source: fetching database structure data in progress
ru: идёт загрузка структуры базы данных

source: fetching database structure in progress
ru: загрузка структуры базы данных

source: fetching table data…
ru: получение данных таблицы…

source: field
ru: поле

source: Field
ru: Поле

source: Field is not editable. Couldn't identify field origin unambiguously (%ld matches).
ru: Поле не редактируемо. Невозможно однозначно определить его происхождение (%ld совпадений).

source: Field is not editable. Field has no or multiple table or database origin(s).
ru: Поле не является редактируемым. Поле не связано с одной или несколькими таблицами или базами данных.

source: Field is not editable. No matching record found. Reload data, check encoding, or try to add a primary key field or more fields in your SELECT statement for table '%@' to identify field origin unambiguously.
ru: Поле не редактируемо. Не найена соответствующая запись. Перезагрузите данные, проверить кодировку или попробуйте добавить первичный ключ к одному или нескольким полям в вашем SELECT запросе для таблицы '%@' для однозначного определения записей.

source: Field is not editable. No matching record found. Reload table, check the encoding, or try to add a primary key field or more fields in the view declaration of '%@' to identify field origin unambiguously.
ru: Поле не редактируемо. Не найена соответствующая запись. Перезагрузите таблицу, проверьте кодировку или попробуйте добавить первичный ключ к одному или нескольким полям в разделе Структура для '%@' для однозначного определения записей.

source: File couldn't be read.
ru: Файл не читается.

source: File couldn't be read: %@ It will be deleted.
ru: Файл не читается.: %@ Он будет удалён.

source: File read error
ru: Ошибка чтения файла

source: Files with the same names already exist in the target folder. Replacing them will overwrite their current contents.
ru: Файлов с теми же именами уже существует в целевой папке. Их замена перезапишет текущее содержимое.

source: Filter
ru: Отфильтровать

source: Apply Filter(s)
ru: Применить фильтр(ы)

source: Filter Tables
ru: Фильтр таблиц

source: Filtered table content
ru: Отфильтрованное содержимое таблицы

source: Filtering failed. Please try again.
ru: Фильтрация не удалась. Пожалуйста, попробуйте ещё раз.

source: Filtering table...
ru: Фильтрация таблицы...

source: Finished exporting to %@
ru: Экспорт в %@ завершён

source: Finished importing %@
ru: Импорт %@ завершён

source: Flush %@
ru: Очистка %@

source: Flush Selected Items
ru: Очистить выбранные элементы

source: Flush Table
ru: Очистить таблицу

source: Flush table failed.
ru: Сбой очистки таблицы.

source: Flush View
ru: Очистить представление

source: Flushed Privileges
ru: Привилегии перезагружены

source: For BIT fields only “1” or “0” are allowed.
ru: Для BIT полей разрешено использовать только "1" или "0".

source: Force delete (disables integrity checks)
ru: Принудительно удалить (отключить проверки целостности)

source: function
ru: функция

source: FUNCTION INFORMATION
ru: О ФУНКЦИИ

source: functions
ru: функции

source: General
ru: Основные

source: General Preferences
ru: Основные настройки

source: General Scope commands will run application-wide
ru: Общая область команды будут нацелены на всё приложение

source: Generating print document...
ru: Создание документа для печати...

source: Generation Time
ru: Время формирования

source: Global
ru: Общие

source: Globally stored favorites
ru: Общие избранные

source: Gzip compression
ru: Gzip сжатие

source: Help topics for %@
ru: Справки для %@

source: Hide Console
ru: Скрыть консоль

source: Hide Navigator
ru: Скрыть Навигатор

source: Hide Tab Bar
ru: Скрыть панель вкладок

source: Hide Toolbar
ru: Скрыть панель инструментов

source: Host
ru: Хост

source: Ignore
ru: Пропустить

source: Ignore All Errors
ru: Игнорировать все ошибки

source: Ignore all Fields
ru: Игнорировать все поля

source: Ignore field
ru: Игнорировать поле

source: Ignore Field
ru: Игнорировать поле

source: Import
ru: Импорт

source: Import all Fields
ru: Импорт всех полей

source: Import Anyway
ru: Всё равно импортировать

source: Import cancelled!
ru: Импорт отменён!

source: Import Error
ru: Ошибка импорта

source: Import field
ru: Импорт поля

source: Import file does not exist.
ru: Импортируемый файл не существует.

source: Import of the selected data is currently not supported.
ru: Импорт выбранных данных в настоящее время не поддерживается.

source: Imported %@ of %@
ru: Импортировано %1$@ из %2$@

source: Imported %@ of CSV data
ru: Импортировано %@ из CSV данных

source: Imported %@ of SQL
ru: Импортировано SQL: %@

source: Importing CSV
ru: Импорт CSV

source: Importing SQL
ru: Импорт SQL
